In [107]:
import os

# check the list of files in the directory.
os.system('ls -lash')

total 336K
4,0K drwxrwxr-x  2 andsilva andsilva 4,0K fev 27 11:34 .
4,0K drwxrwxr-x 10 andsilva andsilva 4,0K fev 26 13:13 ..
 80K -rw-rw-r--  1 andsilva andsilva  77K fev 28 22:44 atitanic.ipynb
4,0K -rw-rw-r--  1 andsilva andsilva  248 fev 26 13:14 README.md
 28K -rw-rw-r--  1 andsilva andsilva  28K fev 27 11:33 test.csv
108K -rw-rw-r--  1 andsilva andsilva 105K fev 26 13:13 titanic.csv
4,0K -rw-rw-r--  1 andsilva andsilva 3,5K fev 26 13:16 titanic_labic.py
 44K -rw-rw-r--  1 andsilva andsilva  43K fev 27 12:36 titanic_tensorf.ipynb
 60K -rw-rw-r--  1 andsilva andsilva  60K fev 27 11:33 train.csv

0

In [108]:
# get the first lines of the dataset
# using the 
os.system('head titanic.csv')

pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,,"Montreal, PQ / Chesterville, ON"
1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.55,C22 C26,S,,,"Montreal, PQ / Chesterville, ON"
1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.55,C22 C26,S,,135.0,"Montreal, PQ / Chesterville, ON"
1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.55,C22 C26,S,,,"Montreal, PQ / Chesterville, ON"
1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.55,E12,S,3,,"New York, NY"
1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,,"Hudson, NY"
1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S,,,"Belfast, NI"
1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,,"Bayside, Queens, NY"

0

In [109]:
# libraries
import pandas as pd

In [110]:
# Loading dataset - Titanic to the dataframe pandas
df = pd.read_csv('titanic.csv')

In [111]:
# Shape - dataset
print(f"Shape dataset Full:.........observations/rows: {df.shape[0]}")
print(f"Shape dataset Full:...................columns: {df.shape[1]}")

Shape dataset Full:.........observations/rows: 1309
Shape dataset Full:...................columns: 14

In [112]:
# Exploratory Data Analysis
df.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [113]:
# dataset - info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [114]:
# dataset - feature datatypes
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [115]:
# Looking for NaN on the dataset.
# counting the number of NaN for each feature.
df.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [116]:
# list columns - nans
nans_columns = df.columns[df.isnull().any()].tolist()
nans_columns

['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [117]:
dict_miss_nans = {}

for icol in nans_columns:
    dict_miss_nans[icol] = df[icol].isna().sum()
    
dict_miss_nans

{'age': 263,
 'fare': 1,
 'cabin': 1014,
 'embarked': 2,
 'boat': 823,
 'body': 1188,
 'home.dest': 564}

In [118]:
df[nans_columns]

,age,fare,cabin,embarked,boat,body,home.dest
0,29.0000,211.3375,B5,S,2,NaN,"St Louis, MO"
1,0.9167,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2.0000,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,30.0000,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,25.0000,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,14.5000,14.4542,NaN,C,NaN,328.0,NaN
1305,NaN,14.4542,NaN,C,NaN,NaN,NaN
1306,26.5000,7.2250,NaN,C,NaN,304.0,NaN
1307,27.0000,7.2250,NaN,C,NaN,NaN,NaN
1308,29.0000,7.8750,NaN,S,NaN,NaN,NaN

In [119]:
df[nans_columns].dtypes

age          float64
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [120]:
for icol in nans_columns:
    if df[icol].dtypes == 'float64':
        df[icol] = df[icol].fillna(df[icol].mean())
    else:
        df[icol] = df[icol].fillna(df[icol].mode())

In [121]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,B5,S,2,160.809917,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,C22 C26,S,11,160.809917,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.000000,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,NaN,C,NaN,328.000000,NaN
1305,3,0,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,NaN,C,NaN,160.809917,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,NaN,C,NaN,304.000000,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,NaN,C,NaN,160.809917,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,NaN,S,NaN,160.809917,NaN

In [122]:
# counting the number of NaN for each feature.
df[nans_columns].isna().sum()

age             0
fare            0
cabin        1014
embarked        2
boat          823
body            0
home.dest     564
dtype: int64

In [123]:
df[nans_columns].dropna()

,age,fare,cabin,embarked,boat,body,home.dest
0,29.0000,211.3375,B5,S,2,160.809917,"St Louis, MO"
1,0.9167,151.5500,C22 C26,S,11,160.809917,"Montreal, PQ / Chesterville, ON"
5,48.0000,26.5500,E12,S,3,160.809917,"New York, NY"
6,63.0000,77.9583,D7,S,10,160.809917,"Hudson, NY"
8,53.0000,51.4792,C101,S,D,160.809917,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...
520,20.0000,13.8625,D38,C,7,160.809917,"Cologne, Germany"
521,29.0000,10.5000,F33,S,11,160.809917,"Folkstone, Kent / New York, NY"
573,27.0000,10.5000,E101,S,16,160.809917,"Bath, England / Massachusetts"
584,32.5000,13.0000,E101,S,12,160.809917,"England / Hartford, CT"
605,25.0000,7.6500,F G63,S,A,160.809917,"Perkins County, SD"

In [124]:
df[nans_columns].dtypes

age          float64
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [125]:
dict_nan_modes = {}

for icol in nans_columns:
    if df[icol].dtypes == 'object':
        dict_nan_modes[icol] = df[icol].mode().values[0]
        
dict_nan_modes

{'cabin': 'C23 C25 C27',
 'embarked': 'S',
 'boat': '13',
 'home.dest': 'New York, NY'}

In [126]:
type(df[icol].mode())

pandas.core.series.Series

In [127]:
df[nans_columns]

,age,fare,cabin,embarked,boat,body,home.dest
0,29.000000,211.3375,B5,S,2,160.809917,"St Louis, MO"
1,0.916700,151.5500,C22 C26,S,11,160.809917,"Montreal, PQ / Chesterville, ON"
2,2.000000,151.5500,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"
3,30.000000,151.5500,C22 C26,S,NaN,135.000000,"Montreal, PQ / Chesterville, ON"
4,25.000000,151.5500,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,14.500000,14.4542,NaN,C,NaN,328.000000,NaN
1305,29.881135,14.4542,NaN,C,NaN,160.809917,NaN
1306,26.500000,7.2250,NaN,C,NaN,304.000000,NaN
1307,27.000000,7.2250,NaN,C,NaN,160.809917,NaN
1308,29.000000,7.8750,NaN,S,NaN,160.809917,NaN

In [128]:
# counting the number of NaN for each feature.
df[nans_columns].isna().sum()

age             0
fare            0
cabin        1014
embarked        2
boat          823
body            0
home.dest     564
dtype: int64

In [129]:
for icol in dict_nan_modes:
    df[icol] = df[icol].fillna(dict_nan_modes[icol])

In [130]:
# counting the number of NaN for each feature.
df[nans_columns].isna().sum()

age          0
fare         0
cabin        0
embarked     0
boat         0
body         0
home.dest    0
dtype: int64

In [131]:
df.head(100)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,160.809917,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,160.809917,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,13,160.809917,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,13,135.000000,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,13,160.809917,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,1,1,"Dodge, Mrs. Washington (Ruth Vidaver)",female,54.0000,1,1,33638,81.8583,A34,S,5,160.809917,"San Francisco, CA"
96,1,0,"Douglas, Mr. Walter Donald",male,50.0000,1,0,PC 17761,106.4250,C86,C,13,62.000000,"Deephaven, MN / Cedar Rapids, IA"
97,1,1,"Douglas, Mrs. Frederick Charles (Mary Helene B...",female,27.0000,1,1,PC 17558,247.5208,B58 B60,C,6,160.809917,"Montreal, PQ"
98,1,1,"Douglas, Mrs. Walter Donald (Mahala Dutton)",female,48.0000,1,0,PC 17761,106.4250,C86,C,2,160.809917,"Deephaven, MN / Cedar Rapids, IA"
99,1,1,"Duff Gordon, Lady. (Lucille Christiana Sutherl...",female,48.0000,1,0,11755,39.6000,A16,C,1,160.809917,London / Paris

In [132]:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [133]:
from sklearn.neural_network import MLPClassifier
from sklearn.datasets import make_classification
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

In [134]:
# convert object type to category type
df[df.select_dtypes(['object']).columns] = df.select_dtypes(['object']).apply(lambda x: x.astype('category'))

In [135]:
df.dtypes

pclass          int64
survived        int64
name         category
sex          category
age           float64
sibsp           int64
parch           int64
ticket       category
fare          float64
cabin        category
embarked     category
boat         category
body          float64
home.dest    category
dtype: object

In [136]:
list_cats = list(df.select_dtypes(include=['category']).columns)
list_cats

['name', 'sex', 'ticket', 'cabin', 'embarked', 'boat', 'home.dest']

In [137]:
# creating instance of labelencoder
labelencoder = LabelEncoder()
labelencoder

LabelEncoder()

In [138]:
for icol in list_cats:
    df[icol] = labelencoder.fit_transform(df[icol])

In [139]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,21,0,29.000000,0,0,187,211.3375,43,2,11,160.809917,308
1,1,1,23,1,0.916700,1,2,49,151.5500,79,2,2,160.809917,230
2,1,0,24,0,2.000000,1,2,49,151.5500,79,2,4,160.809917,230
3,1,0,25,1,30.000000,1,2,49,151.5500,79,2,4,135.000000,230
4,1,0,26,0,25.000000,1,2,49,151.5500,79,2,4,160.809917,230
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,1291,0,14.500000,1,0,259,14.4542,80,0,4,328.000000,236
1305,3,0,1292,0,29.881135,1,0,259,14.4542,80,0,4,160.809917,236
1306,3,0,1293,1,26.500000,0,0,250,7.2250,80,0,4,304.000000,236
1307,3,0,1294,1,27.000000,0,0,264,7.2250,80,0,4,160.809917,236
1308,3,0,1295,1,29.000000,0,0,346,7.8750,80,2,4,160.809917,236

### Modeling

In [140]:
# Alternatively X and y can be obtained directly from the dataframe attribute:
X = df.drop('survived', axis=1) # drop the column target
y = df['survived'] # target

In [141]:
# show the possible values to the target variable
y.unique()

array([1, 0])

In [142]:
# Memory used right now!
df.info(verbose=False, memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Columns: 14 entries, pclass to home.dest
dtypes: float64(3), int64(11)
memory usage: 143.3 KB

In [143]:
# Split-out validation dataset
X_train, X_validation, Y_train, Y_validation = train_test_split(X, y, test_size=0.2, random_state=1)

In [144]:
print(f'X - train shape -> {X_train.shape}')
print(f'Y - train shape -> {Y_train.shape}')
print(f'X - validation shape ->{X_validation.shape}')
print(f'Y - validation shape ->{Y_validation.shape}')

X - train shape -> (1047, 13)
Y - train shape -> (1047,)
X - validation shape ->(262, 13)
Y - validation shape ->(262,)

In [145]:
# modeling
clf = MLPClassifier(random_state=1, max_iter=300).fit(X_train, Y_train)
clf

MLPClassifier(max_iter=300, random_state=1)

In [146]:
clf.predict_proba(X_validation[:1])

array([[0.31744401, 0.68255599]])

In [147]:
round(clf.score(X_validation, Y_validation), 4)

0.7672